{
  "paragraphs": [
    {
      "id": 1,
      "body": "This week has marked the start of the procedural terrain system. So far, I have only managed to implement a system for generating one chunk by itself, and it still has a few unresolved bugs, even though I managed to sort out the more serious ones, relating to the terrain tiles' rotation, that made everything look wrong.\n\nIt unfortunately seems I am already behind schedule. I am hoping that some of the items on my schedule will take a lot less time than initially thought, so that I can finish my part by next Wednesday (a complete terrain system for one biome, foliage not included) hand the rest of the terrain system to my programmer and can get on with designing and implementing the combat system. However it seems I have massively underestimated the time this current system will take to implement.",
      "title": "Starting work on the chunk system",
      "dateAdded": "2023/2/18",
      "lastModified": "2023/2/18 1:46"
    },
    {
      "id": 2,
      "body": "IT WORKS!! It took my last remaining sanity, but I have managed to make the chunks for my terrain generation work without any bugs. At least none that I encountered so far. It took a lot longer than I expected, but the hardest part is done. \n\nFor the first time since I have started working on this system, I feel really excited to continue developing it. Next up, I will be working on spawning multiple chunks at the same time, and generating them seamlessly along the border. And once that part is done, I can make a build out of the game that I can send to testers, to test the limitations of this implementation.\n\nMy main concerns at the moment, are that unreal can't really handle this many instances of the terrain tiles, although supposedly nanite is very good at solving this exact problem. I am also looking to test how much building the game improves the performance of my terrain generation, and if I run any problems while compiling blueprints down to C++. Hopefully, I will have a clearer answer to most of these questions over the course of the next week.",
      "title": "Finishing the chunk",
      "dateAdded": "2023/2/19",
      "lastModified": "2023/2/19 3:9"
    },
    {
      "id": 3,
      "body": "My sanity has been truly put to the test. I have not posted in a while due to an issue with the blog app itself, so in a quick summary:\n\n-I have finished implementing terrain generation seamlessly using multiple chunks. It turned out to be extremely slow.\n\n-I started implementing new C++ classes to optimize the generation system. Unfortunately, due to some internal problem with unreal, my BP only project failed to compile all the changes when adding in C++ classes. This has lead to a total of 2 weeks of nothing but working out the issue.\n\n-After it was done, I implemented Multithreading into the game's blueprints, which did help a lot with performance.\n\nUnfortunately, both the chunk management system and the chunk generation still take a long time executing its function, so I will need to transfer a bit of the code into C++ to make the system a bit faster. I have started on the implementation today, and have learned a lot about Unreal's internal C++ scripting methods.",
      "title": "Blueprint to C++",
      "dateAdded": "2023/3/12",
      "lastModified": "2023/3/12 1:29"
    }
  ]
}